# <center>Laboratorium Analiza i bazy danych </center>

## <center>Łączenie tabel, podzapytania i funkcje agregujące</center>

## Przykładowe tabele obrazujące łączenie

Do zobrazowania operacji łączenia zostaną użyte tabele:

```sql
CREATE TABLE shape_a (
    id INT PRIMARY KEY,
    shape VARCHAR (100) NOT NULL
);
 
CREATE TABLE shape_b (
    id INT PRIMARY KEY,
    shape VARCHAR (100) NOT NULL
);
```
 
Polecenie CREATE TABLE tworzy tabelę o zadanej nazwie i strukturze. Ogólna postać to:
```sql
CREATE TABLE tab_name (
    col_name1 data_type constrain,
    col_name1 data_type constrain,
    ...
);
```
Należy uzupełnić ją danymi:
```sql
INSERT INTO shape_a (id, shape)
VALUES
    (1, 'Trójkąt'),
    (2, 'Kwadrat'),
    (3, 'Deltoid'),
    (4, 'Traper');
 
INSERT INTO shape_b (id, shape)
VALUES
    (1, 'Kwadrat'),
    (2, 'Trójkąt'),
    (3, 'Romb'),
    (4, 'Równoległobok');
```
Komenda INSERT INTO pozwala na dodanie do tabeli rekordów. Ogólna postać to:

```sql
INSERT INTO tab_name (col1_name, col2_name2, ...) 
VALUES
    (val1_col1, val2_col2),
    (val2_col1, val2_col2),
    ...
```

## Inner join 

Jest to podstawowy rodzaj złączenie. Ten sposób złączenia wybiera  te wiersze, dla których warunek złączenia jest spełniony. W żadnej z łączonych tabel kolumna użyta do łączenia nie może mieć wartości NULL. 

#### Przykład:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
INNER JOIN shape_b b ON a.shape = b.shape;
```
W zapytaniu powyżej użyto *aliasów* nazw tabel i column wynikowych, jest to szczególnie przydatne przy długich nazwach tabel i wprowadza czytelność w zapytaniu.

#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Trójkąt|2|Trójkąt|
|2|Kwadrat|1|Kwadrat|

## OUTER JOIN

Istnieją trzy rodzaje złączeń OUTER:
- LEFT OUTER JOIN,
- RIGHT OUTER JOIN,
- FULL OUTER JOIN.

### LEFT OUTER JOIN

Ten rodzaj złączenie zwróci wszystkie rekordy z lewej tablicy i dopasuje do nich rekordy z prawej tablicy które spełniją zadany warunek złączenia. Jeżeli w prawej tablicy nie występują rekordy spełnijące warunek złączenia z lewą w ich miejscu pojawią się wartości NULL.

#### Przykład 1:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
LEFT JOIN shape_b b ON a.shape = b.shape;
```
#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Trójkąt|2|Trójkąt|
|2|Kwadrat|1|Kwadrat|
|3|Deltoid|NULL|NULL|
|4|Traper|NULL|NULL|

#### Przykład 2:
```sql
SELECT
    b.id id_b,
    b.shape shape_b,
    a.id id_a,
    a.shape shape_a   
FROM
    shape_b b
LEFT JOIN shape_a a ON a.shape = b.shape;
```
#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Kwadrat|2|Kwadrat|
|2|Trójkąt|1|Trójkąt|
|3|Romb|NULL|NULL|
|4|Równoległobok|NULL|NULL|

### RIGHT OUTER JOIN

Działa jak left outer join z tym, że prawa tablica w zapytaniu jest brana w całości.

#### Przykład:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
RIGHT JOIN shape_b b ON a.shape = b.shape;
```

#### Wynik:
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|2|Kwadrat|1|Kwadrat|
|1|Trójkąt|2|Trójkąt|
|NULL|NULL|3|Romb|
|NULL|NULL|4|Równoległobok|


### FULL OUTER JOIN

Jest złączeniem które zwraca:
- wiersze dla których warunek złączenia jest spełniony,
- wiersze z lewej tabeli dla których nie ma odpowiedników w prawej,
- wiersze z prawej tabeli dla których nie ma odpowiedników w lewej. 

#### Przykład:
```sql
SELECT
    a.id id_a,
    a.shape shape_a,
    b.id id_b,
    b.shape shape_b
FROM
    shape_a a
FULL JOIN shape_b b ON a.shape = b.shape;
```
|id_a|shape_a|id_b|shape_b|
|-|-|-|-|
|1|Trójkąt|2|Trójkąt|
|2|Kwadrat|1|Kwadrat|
|3|Deltoid"|NULL|NULL|
|4|Traper|NULL|NULL|
|NULL|NULL|3|Romb|
|NULL|NULL|4|Równoległobok|

## Podzapytania

Podzapytanie zagnieżdżone SELECT znajduje się wewnątrz zewnętrznego zapytania SELECT, np. po klauzuli WHERE, HAVING lub FROM. W przypadku tego rodzaju zapytań w pierwszej kolejności wykonywane są wewnętrzne zapytania SELECT, a ich wynik jest wykorzystywany do zewnętrznego zapytania SELECT. Stąd łatwo zuważyć, że mogą one służyć do poprawy wydajności obsługi zapytania. Należy dobierać podzapytania tak by najbardziej zagnieżdżone podzapytanie zawierało najmniejszy zbiór poszukiwań. 

#### Przykład:
Jeżeli chcemy znaleźć w bazie informację o tytułach filmów zwróconych w zadanym okresie możemy wykonać następujące zapytanie:
```sql
SELECT
   film_id,
   title
FROM
   film
WHERE
   film_id IN (
      SELECT
         inventory.film_id
      FROM
         rental
      INNER JOIN inventory ON inventory.inventory_id = rental.inventory_id
      WHERE
         return_date BETWEEN '2005-05-29'
      AND '2005-05-30'
   );
```

#### Wynik
|film_id|title|
|-|-|
|307|Fellowship Autumn|
|255|Driving Polish|
|388|Gunfight Moon|
|130|Celebrity Horn|
|563|Massacre Usual|
|397|Hanky October|
|...|...|

### Używanie podzapytań

Pod zapytania mogą być używane w :
- SELECT,
- UPDATE,
- DELETE,
- Funkcjach agregujących,
- Do definiowania tabel tymczasowych.

Używając podzapytań zapytania SQL szybko mogą stać się mało czytelne. Przez co będą trudne w zrozumieniu i późniejszym utrzymaniu. W celu analizy zapytań można użyć klauzuli __EXPLAIN__, która przeanalizuje zapytanie. Klauzula ta może służyć również do porównywania wydajności zapytań

#### Przykład:
```sql
EXPLAIN SELECT
   *
FROM
   film
```

## Funkcje agregujące

Funkcje agregujące wykonują obliczenia na zestawie wierszy i zwracają pojedynczy wiersz. PostgreSQL udostępnia wszystkie standardowe funkcje agregujące SQL w następujący sposób:
- AVG () - zwraca średnią wartość.
- COUNT () - zwraca liczbę wartości.
- MAX () - zwraca maksymalną wartość.
- MIN () - zwraca minimalną wartość.
- SUM () - zwraca sumę wszystkich lub różnych wartości.

Pełna lista funkcji agregującej: https://www.postgresql.org/docs/9.5/functions-aggregate.html

Często używamy funkcji agregujących z klauzulą GROUP BY w instrukcji SELECT. W tych przypadkach klauzula GROUP BY dzieli zestaw wyników na grupy wierszy i funkcja agregująca wykonuje obliczenia dla każdej grupy, np. maksimum, minimum, średnia itp. Funkcji agregujących można używać funkcji agregujących jako wyrażeń tylko w następujących klauzulach: SELECT i HAVING.

### GROUP BY
Klauzula GROUP BY dzieli wiersze zwrócone z instrukcji SELECT na grupy. Dla  każdej grupy można zastosować funkcję agregującą, np. SUM aby obliczyć sumę pozycji lub
COUNT aby uzyskać liczbę elementów w grupach.

Poniższa instrukcja ilustruje składnię klauzuli GROUP BY:
```sql
SELECT 
    column_1, 
    aggregate_function(column_2)
FROM 
    tbl_name
GROUP BY 
    column_1;
```
Klauzula GROUP BY musi pojawić się zaraz po klauzuli FROM lub WHERE, n0astępnie GROUP BY zawiera listę  kolumna oddzielonych przecinkami. 

### HAVING
Często używamy klauzuli HAVING w połączeniu z klauzulą GROUP BY do filtrowania wierszy grup
które nie spełniają określonego warunku.

Poniższa instrukcja ilustruje typową składnię klauzuli HAVING:
```sql
SELECT
    column_1,
    aggregate_function (column_2)
FROM
    tbl_name
GROUP BY
    column_1
HAVING
    condition;
```
Klauzula HAVING ustawia warunek dla wierszy grup utworzonych przez klauzulę GROUP BY.  

Klauzula GROUP BY ma zastosowanie, podczas gdy klauzula WHERE określa wcześniej warunki dla poszczególnych wierszy.

## Zadania wprowadzające
Wykonaj zapytania przy użyciu DBMS:  
  
1. Znajdź listę wszystkich filmów o tej samej długości.
2. Znajdź wszystkich klientów mieszkających w tym samym mieście.
3. Oblicz średni koszt wypożyczenia wszystkich filmów.
4. Oblicz i wyświetl liczbę filmów we wszystkich kategoriach.
5. Wyświetl liczbę wszystkich klientów pogrupowanych według kraju.
6. Wyświetl informacje o sklepie, który ma więcej niż 100 klientów i mniej niż 300 klientów.
7. Wybierz wszystkich klientów, którzy oglądali filmy ponad 200 godzin.
8. Oblicz średnią wartość wypożyczenia filmu.
9. Oblicz średnią wartość długości filmu we wszystkich kategoriach.
10. Znajdź najdłuższe tytuły filmowe we wszystkich kategoriach.
11. Znajdź najdłuższy film we wszystkich kategoriach. Porównaj wynik z pkt 10.

## Zadanie implementacyjne
Zaimplementuj wszystkie funkcje w pliku main.py zgodnie z opisem a następnie przetestuj je w notatniku.

In [41]:
import pandas as pd

import main

In [42]:
import sqlalchemy
from sqlalchemy import create_engine
import datetime
db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)
connection_sqlalchemy = db.connect()

### Zapytanie 1
#### długość filmu -> 117

In [43]:
df = pd.read_sql("""
select *
from film
where film.length=117
""", con=connection_sqlalchemy)
df

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,last_update,special_features,fulltext
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,2013-05-26 14:50:58.951,[Trailers],'chamber':1 'fate':4 'husband':11 'italian':2 ...
1,4,Affair Prejudice,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,2013-05-26 14:50:58.951,"[Commentaries, Behind the Scenes]",'affair':1 'chase':14 'documentari':5 'fanci':...
2,374,Graffiti Love,A Unbelieveable Epistle of a Sumo Wrestler And...,2006,1,3,0.99,117,29.99,PG,2013-05-26 14:50:58.951,"[Trailers, Deleted Scenes]",'berlin':19 'build':15 'compos':17 'epistl':5 ...
3,547,Magic Mallrats,A Touching Documentary of a Pastry Chef And a ...,2006,1,3,0.99,117,19.99,PG,2013-05-26 14:50:58.951,"[Trailers, Commentaries]","'build':16 'california':21 'chef':9,13 'docume..."
4,727,Resurrection Silverado,A Epic Yarn of a Robot And a Explorer who must...,2006,1,6,0.99,117,12.99,PG,2013-05-26 14:50:58.951,"[Trailers, Deleted Scenes]",'challeng':14 'convent':20 'epic':4 'explor':1...

### Zapytanie 2
#### miasto - id 312 - Londyn

In [44]:
df = pd.read_sql("""
select cu.first_name, cu.last_name, city.city
from customer cu
join address ad on cu.address_id = ad.address_id
join city on ad.city_id = city.city_id and city.city_id = 312
""", con=connection_sqlalchemy)
df

  first_name last_name    city
0     Mattie   Hoffman  London
1      Cecil     Vines  London

### Zapytanie 3
#### średni koszt wypożyczenia wszystkich filmów.
Podobne zapytanie co nr 8 - nie wiem jak je interpretować. Przyjmuję że chodzi o policzenie średniej ceny wypożyczenia każdego
filmu z kolei i suma tego wyniku -> koszt wypożyczenia wszystkich filmów "na raz".

In [66]:
df = pd.read_sql("""
select
distinct film.title, avg(p.amount) amount
from film
join inventory inv on film.film_id = inv.film_id
join rental r on inv.inventory_id = r.inventory_id
join payment p on r.rental_id = p.rental_id
group by film.film_id""",con = connection_sqlalchemy)
print("Suma średnich cen wypożyczeń filmów:", "%.2f" % sum(df.amount))
df

Suma średnich cen wypożyczeń filmów: 4038.49

                   title    amount
0             Sling Luke  2.490000
1            Moulin Wake  3.240000
2              Wonka Sea  3.712222
3    Backlash Undefeated  8.802500
4           Eyes Driving  4.302500
..                   ...       ...
953       Sweden Shining  6.364375
954      Terminator Club  6.656667
955           Mask Peach  3.561429
956         Right Cranes  5.290000
957        Minority Kiss  2.324167

[958 rows x 2 columns]

### Zapytanie 4
#### Oblicz i wyświetl liczbę filmów we wszystkich kategoriach.

In [46]:
df = pd.read_sql("""
select category.name, count(f.title) amount
from category
join film_category fc on category.category_id = fc.category_id
join film f on fc.film_id = f.film_id
group by category.name""",con=connection_sqlalchemy)
df

           name  amount
0        Sports      74
1      Classics      57
2           New      63
3        Family      69
4        Comedy      58
5     Animation      66
6        Travel      57
7         Music      51
8         Drama      62
9        Horror      56
10       Sci-Fi      61
11        Games      61
12  Documentary      68
13      Foreign      73
14       Action      64
15     Children      60

### Zapytanie 5
#### Wyświetl liczbę wszystkich klientów pogrupowanych według kraju.

In [47]:
df = pd.read_sql("""
select country.country, count(c.customer_id) amount
from country
join city on country.country_id = city.country_id
join address ad on city.city_id = ad.city_id
join customer c on ad.address_id = c.address_id
group by country.country""", con=connection_sqlalchemy)
df

                  country  amount
0              Bangladesh       3
1               Indonesia      14
2               Venezuela       7
3                Cameroon       2
4          Czech Republic       1
..                    ...     ...
103              Tanzania       3
104                Poland       8
105             Greenland       1
106         French Guiana       1
107  Virgin Islands, U.S.       1

[108 rows x 2 columns]

### Zapytanie 6
#### Wyświetl informacje o sklepie, który ma więcej niż 100 klientów i mniej niż 300 klientów.

In [48]:
df = pd.read_sql("""
select store.*, count(distinct payment.customer_id) amount
from store
join staff on store.store_id = staff.store_id
join payment on staff.staff_id = payment.staff_id
group by store.store_id
having count(distinct payment.customer_id) > 100 and count(distinct payment.customer_id) < 300""", con=connection_sqlalchemy)
df

Empty DataFrame
Columns: [store_id, manager_staff_id, address_id, last_update, amount]
Index: []

### Zapytanie 7
#### Wybierz wszystkich klientów, którzy oglądali filmy ponad 200 godzin.

In [73]:
df = pd.read_sql("""
select cu.first_name, cu.last_name, sum(film.length) total
from customer cu
join rental r on cu.customer_id = r.customer_id
join inventory inv on r.inventory_id = inv.inventory_id
join film on inv.film_id = film.film_id
group by cu.first_name, cu.last_name
having sum(film.length) > 1200
order by total desc, cu.last_name, cu.first_name""", con=connection_sqlalchemy)
df

    first_name last_name  total
0         Karl      Seal   5388
1      Eleanor      Hunt   5360
2        Tammy   Sanders   5065
3       Wesley      Bull   4808
4        Clara      Shaw   4808
..         ...       ...    ...
594    Tiffany    Jordan   1667
595  Katherine    Rivera   1615
596      Leona    Obrien   1588
597    Antonio      Meek   1451
598      Brian     Wyman   1265

[599 rows x 3 columns]

### Zapytanie 8
#### Oblicz średnią wartość wypożyczenia filmu
niezbyt jestem pewny co mam rozumieć przez średnią wartość wypożyczenia filmu - wziąłem po prostu średnią wszystkich płatności

In [65]:
df = pd.read_sql("""
select avg(amount) average_price
from payment
""", con=connection_sqlalchemy)

print("Średnia cena wypożyczenia filmu: ", "%0.2f" % df.iloc[0,0])
df

Średnia cena wypożyczenia filmu:  4.20

   average_price
0       4.200606

### Zapytanie 9
#### Oblicz średnią wartość długości filmu we wszystkich kategoriach.

In [51]:
df = pd.read_sql("""
select cat.name, avg(f.length) average_length
from category cat
join film_category fc on cat.category_id = fc.category_id
join film f on fc.film_id = f.film_id
group by cat.name""", con=connection_sqlalchemy)

df

           name  average_length
0        Sports      128.202703
1      Classics      111.666667
2           New      111.126984
3        Family      114.782609
4        Comedy      115.827586
5     Animation      111.015152
6        Travel      113.315789
7         Music      113.647059
8         Drama      120.838710
9        Horror      112.482143
10       Sci-Fi      108.196721
11        Games      127.836066
12  Documentary      108.750000
13      Foreign      121.698630
14       Action      111.609375
15     Children      109.800000

### Zapytanie 10
#### Znajdź najdłuższe tytuły filmowe we wszystkich kategoriach.

In [52]:
df = pd.read_sql("""
select distinct on (cat.name) cat.name, f.title, length(f.title)
from film f
join film_category fc on f.film_id = fc.film_id
join category cat on fc.category_id = cat.category_id
order by cat.name, length(f.title) desc
""", con=connection_sqlalchemy)

df

           name                        title  length
0        Action      Entrapment Satisfaction      23
1     Animation       Telemark Heartbreakers      22
2      Children         Microcosmos Paradise      20
3      Classics      Extraordinary Conquerer      23
4        Comedy      Trainspotting Strangers      23
5   Documentary       Deliverance Mulholland      22
6         Drama       Goldfinger Sensibility      22
7        Family       Resurrection Silverado      22
8       Foreign         Impossible Prejudice      20
9         Games        Bulworth Commandments      21
10       Horror  Arachnophobia Rollercoaster      27
11        Music       Confidential Interview      22
12          New        Flamingos Connecticut      21
13       Sci-Fi         Wonderland Christmas      20
14       Sports    Satisfaction Confidential      25
15       Travel      Desperate Trainspotting      23

### Zapytanie 11
##### Znajdź najdłuższy film we wszystkich kategoriach. Porównaj wynik z pkt 10.

In [80]:
df = pd.read_sql("""
select distinct on (cat.name) cat.name, f.title, max(f.length)
from film f
join film_category fc on f.film_id = fc.film_id
join category cat on fc.category_id = cat.category_id
group by cat.name, f.title
""", con=connection_sqlalchemy)

df

           name                 title  max
0        Action          Amadeus Holy  113
1     Animation         Alter Victory   57
2      Children   Backlash Undefeated  118
3      Classics        Alice Fantasia   94
4        Comedy       Airplane Sierra   62
5   Documentary      Academy Dinosaur   86
6         Drama           Apollo Teen  153
7        Family           African Egg  130
8       Foreign          Agent Truman  169
9         Games           Autumn Crow  108
10       Horror        Ace Goldfinger   48
11        Music        Alaska Phantom  136
12          New     Amistad Midsummer   85
13       Sci-Fi        Annie Identity   86
14       Sports      Aladdin Calendar   63
15       Travel  Arsenic Independence  137